https://pandas.pydata.org/docs/pandas.pdf
https://towardsdatascience.com/machine-learning-with-the-titanic-dataset-7f6909e58280

After learning Pandas, you’ll be able to ingest, clean, and aggregate large quantities of data, and then use that data with other Python modules like Scipy (for statistical analysis) or Matplotlib (for visualization).

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# matplotlib inline
sns.set()

In [ ]:
# create series
s= pd.Series()
s

In [ ]:
# create series from 1D array
s= pd.Series([2,3,52,4], index= ['a', 'b', 'c', 'd'])
s['c']

In [ ]:
# from dict
s= pd.Series({10:'Ram', 20: 'Shyam', 30: 'Sita'})
s

In [ ]:
# accessing data
s[-1:]

### create DataFrame

In [ ]:
# from list
df= pd.DataFrame([['Ram', 23, 'DU'],['Shyam', 24, 'JNU']], columns= ['Name', 'age', 'Uni'] )
df

In [ ]:
# from dict
df= pd.DataFrame({'Name': ['Ram', 'Shyam', 'Sita'],
                 'Age': [23, 24, 25],
                 'Uni': ['DU', 'IP', 'JNU']})
df

https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/imdb_1000.csv

http://bit.ly/movieusers

In [ ]:
import pandas as pd

In [ ]:
movies= pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/imdb_1000.csv')

In [ ]:
movies.head(5)

In [ ]:
# printing columns
movies.columns

In [ ]:
# read single column
movies['title'].tail(5)

In [ ]:
# read multiple columns
movies[['title', 'genre']].head(10)

In [ ]:
# read single row using loc[R, C]--reading things by label and iloc[R, C]  reading things by index
# movies.loc[1, :]
movies.iloc[1, :]

In [ ]:
# read multiple row by loc and iloc
# movies.loc[[1,3]]
# movies.iloc[[1,3]]
# movies.loc[1:5]
movies.iloc[1:5]

In [ ]:
# read single column using loc and iloc
# movies.loc[:, 'title']
movies.iloc[:, 1]

In [ ]:
# read multiple column using loc and iloc
# movies.loc[:, ['title', 'genre']]
# movies.iloc[:, [1, 3]]
# movies.loc[:, 'title': ]
movies.iloc[:, 1:]

In [ ]:
movies.head(5)

In [ ]:
# read a specific location (R,C) using iloc
movies.loc[2, 'title']

In [ ]:
# movies.title
movies['title']

In [ ]:
# find movies with star rating greater than 9
movies[movies['star_rating']>9].title
# movies[movies['star_rating']>9]['title']

In [ ]:
movies.loc[movies['star_rating']>9, 'title']

In [ ]:
# statistics of the data
movies.describe()

In [ ]:
# finding specific data
movies.head()

### Workig with titanic dataset

For machine learning algorithms to work, it is necessary to convert the raw data into a clean data set and dataset must be converted to numeric data. You have to encode all the categorical lables to column vectors with binary values. Missing values or NaNs in the dataset is an annoying problem. You have to either drop the missing rows or fill them up with a mean or interpolated values..

In [2]:
df = pd.read_csv('D:/train.csv')

In [3]:
# print info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB



survival:    Survival 
PassengerId: Unique Id of a passenger. 
pclass:    Ticket class     
sex:    Sex     
Age:    Age in years     
sibsp:    # of siblings / spouses aboard the Titanic     
parch:    # of parents / children aboard the Titanic     
ticket:    Ticket number     
fare:    Passenger fare     
cabin:    Cabin number     
embarked:    Port of Embarkation

In [4]:
# find rows and columns
df.shape

(891, 12)

In [5]:
# how many survived?? value_counts()
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
# how many unique values?? nunique()
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [7]:
# print the statistics of the DS - describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Analysis

38% out of the training-set survived the Titanic. We can also see that the passenger ages range from 0.4 to 80. On top of that we can already detect some features, that contain missing values, like the ‘Age’ feature.

In [8]:
# sort data based on age
df.sort_values(by= 'Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

1. Convert a lot of features into numeric ones so that the machine learning algorithms can process them. 
2. features have widely different ranges, that we will need to convert into roughly the same scale. 

3. We can also spot some more features, that contain missing values (NaN = not a number), that wee need to deal with.

### Check for missing data & list them

In [9]:
# isnull(), sum(), sort_values(ascending)   [axis=0 (vertical sum), axis=1 (horizontal sum)]
df.isnull().sum(axis=0).sort_values(ascending= False)

Cabin          687
Age            177
Embarked         2
Fare             0
Ticket           0
Parch            0
SibSp            0
Sex              0
Name             0
Pclass           0
Survived         0
PassengerId      0
dtype: int64

The Embarked feature has only 2 missing values, which can easily be filled. It will be much more tricky, to deal with the ‘Age’ feature, which has 177 missing values. 
Since most of Cabin column values are missing we will omit this column along with the Ticket, Fare, PassengerId and Name columns that we will not use for this initial investigation. We will make a new Dataframe in case we want to access the initial one again.

In [10]:
# drop([multiple values])
new_df=df.drop(['Cabin','Ticket','Name','Fare','PassengerId'],axis=1)

In [12]:
new_df.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

### Further Exploration - Visualizations

In [14]:
new_df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

### Corelation between Survived and other features

### Pclass vs Survived

#### groupby() 

It is a very powerful function with a lot of variations. It makes the task of splitting the 
dataframe over some criteria really easy and efficient.
https://www.geeksforgeeks.org/python-pandas-dataframe-groupby/

In [20]:
# Pclass value_counts()
new_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
# Class vs Survived
new_df[['Pclass', 'Survived']].groupby(['Pclass']).mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

### sex vs Survived

In [ ]:
new_df[["Sex", "Survived"]].groupby(['Sex']).mean().sort_values(by='Survived', ascending=False)

In [ ]:
# SibSp vs Survived
#Sibling = brother, sister, stepbrother, stepsister
#Spouse = husband, wife (mistresses and fiancés were ignored)

In [ ]:
df[["SibSp", "Survived"]].groupby(['SibSp']).mean().sort_values(by='Survived', ascending=False)

In [ ]:
# Parch vs Survived
#Parent = mother, father
#Child = daughter, son, stepdaughter, stepson
#Some children travelled only with a nanny, therefore parch=0 for them.

In [ ]:
df[["Parch", "Survived"]].groupby(['Parch']).mean().sort_values(by='Survived', ascending=False)

In [ ]:
# Data sets cleaing, fill nan (null) where needed and delete uneeded columns
new_df= df.fillna(0)
new_df.head(10)